id: 2497c6a4-a62f-4e93-8630-d972bf696c28
name: Monitoring the deletion of security groups in Entra ID
kind: NRT
description: This query looks for deletion of security groups in Entra ID.
severity: Medium
enabled: false
requiredDataConnectors:
  - dataTypes:
      - AuditLogs
    connectorId: AzureActiveDirectory
tactics:
  - Persistence
relevantTechniques:
  - T1098
query: |-
  AuditLogs
  | where OperationName == "Delete group"
  | where Identity <> "Microsoft Approval Management"
  | where Identity <> "Microsoft Substrate Management"
  | extend InitiatorUPN = parse_json(tostring(InitiatedBy.user)).userPrincipalName
  | extend InitiatorObjectID = parse_json(tostring(InitiatedBy.user)).id
  | extend IPAddress =  parse_json(tostring(InitiatedBy.user)).ipAddress
  | extend TargetDisplayName = TargetResources[0].displayName
  | extend TargetObjectID = TargetResources[0].id
suppressionDuration: 5h
eventGroupingSettings:
  aggregationKind: SingleAlert
suppressionEnabled: false
entityMappings:
  - entityType: Account
    fieldMappings:
      - identifier: FullName
        columnName: InitiatorUPN
      - identifier: AadUserId
        columnName: InitiatorObjectID
  - entityType: SecurityGroup
    fieldMappings:
      - identifier: DistinguishedName
        columnName: TargetDisplayName
      - identifier: ObjectGuid
        columnName: TargetObjectID
  - entityType: IP
    fieldMappings:
      - identifier: Address
        columnName: IPAddress
incidentConfiguration:
  createIncident: true
  groupingConfiguration:
    enabled: false
    reopenClosedIncident: false
    lookbackDuration: 5h
    matchingMethod: AllEntities
    groupByEntities: []
    groupByAlertDetails: []
    groupByCustomDetails: []
